# BATCHIMS_TYPE_1:   15
# BATCHIMS_TYPE_2:    8
# BATCHIMS_TYPE_3:    4
# TOTAL:             27

BATCHIMS_TYPE_1 = ['ㄱ', 'ㄴ', 'ㄷ', 'ㅁ', 'ㅂ', 'ㅅ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ', 'ㄲ', 'ㅆ', ]
BATCHIMS_TYPE_2 = ['ㄳ', 'ㄵ', 'ㄶ',  'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅄ', ]
BATCHIMS_TYPE_3 = ['ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', ]

BATCHIM_TRANSCRIPTIONS = {
    # type 1
    'ㄱ': 'k', 'ㄴ': 'n', 'ㄷ': 't', 'ㅁ': 'm', 'ㅂ': 'b', 'ㅅ': 't', 'ㅇ': 'ng', 'ㅈ': 't', 'ㅊ': 't',
    'ㅋ': 'k', 'ㅌ': 't', 'ㅍ': 'p', 'ㅎ': 't', 'ㄲ': 'k', 'ㅆ': 't',
    # type 2
    'ㄳ': 'k', 'ㄵ': 'n', 'ㄶ': 'n', 'ㄽ': 'l', 'ㄾ': 'l', 'ㄿ': 'p', 'ㅀ': 'l', 'ㅄ': 'p',
    # type 3
    'ㄹ': 'l/r', 'ㄺ': 'k/l', 'ㄻ': 'm/l', 'ㄼ': 'p/l',
}
