#  SYLLABLES_TYPE_1: 140
#  SYLLABLES_TYPE_2: 154
#  SYLLABLES_TYPE_3:  50
#  SYLLABLES_TYPE_4:  55
#  TOTAL:            399

SYLLABLES_TYPE_1 = [
    '가', '갸', '거', '겨', '고', '교', '구', '규', '그', '기',
    '나', '냐', '너', '녀', '노', '뇨', '누', '뉴', '느', '니',
    '다', '댜', '더', '뎌', '도', '됴', '두', '듀', '드', '디',
    '라', '랴', '러', '려', '로', '료', '루', '류', '르', '리',
    '마', '먀', '머', '며', '모', '묘', '무', '뮤', '므', '미',
    '바', '뱌', '버', '벼', '보', '뵤', '부', '뷰', '브', '비',
    '사', '샤', '서', '셔', '소', '쇼', '수', '슈', '스', '시',
    '아', '야', '어', '여', '오', '요', '우', '유', '으', '이',
    '자', '쟈', '저', '져', '조', '죠', '주', '쥬', '즈', '지',
    '차', '챠', '처', '쳐', '초', '쵸', '추', '츄', '츠', '치',
    '카', '캬', '커', '켜', '코', '쿄', '쿠', '큐', '크', '키',
    '타', '탸', '터', '텨', '토', '툐', '투', '튜', '트', '티',
    '파', '퍄', '퍼', '펴', '포', '표', '푸', '퓨', '프', '피',
    '하', '햐', '허', '혀', '호', '효', '후', '휴', '흐', '히',
]

SYLLABLES_TYPE_2 = [
    '개', '걔', '게', '계', '과', '괘', '괴', '궈', '궤', '귀', '긔',
    '내', '냬', '네', '녜', '놔', '놰', '뇌', '눠', '눼', '뉘', '늬',
    '대', '댸', '데', '뎨', '돠', '돼', '되', '둬', '뒈', '뒤', '듸',
    '래', '럐', '레', '례', '롸', '뢔', '뢰', '뤄', '뤠', '뤼', '릐',
    '매', '먜', '메', '몌', '뫄', '뫠', '뫼', '뭐', '뭬', '뮈', '믜',
    '배', '뱨', '베', '볘', '봐', '봬', '뵈', '붜', '붸', '뷔', '븨',
    '새', '섀', '세', '셰', '솨', '쇄', '쇠', '숴', '쉐', '쉬', '싀',
    '애', '얘', '에', '예', '와', '왜', '외', '워', '웨', '위', '의',
    '재', '쟤', '제', '졔', '좌', '좨', '죄', '줘', '줴', '쥐', '즤',
    '채', '챼', '체', '쳬', '촤', '쵀', '최', '춰', '췌', '취', '츼',
    '캐', '컈', '케', '켸', '콰', '쾌', '쾨', '쿼', '퀘', '퀴', '킈',
    '태', '턔', '테', '톄', '톼', '퇘', '퇴', '퉈', '퉤', '튀', '틔',
    '패', '퍠', '페', '폐', '퐈', '퐤', '푀', '풔', '풰', '퓌', '픠',
    '해', '햬', '헤', '혜', '화', '홰', '회', '훠', '훼', '휘', '희',
]

SYLLABLES_TYPE_3 = [
    '까', '꺄', '꺼', '껴', '꼬', '꾜', '꾸', '뀨', '끄', '끼',
    '따', '땨', '떠', '뗘', '또', '뚀', '뚜', '뜌', '뜨', '띠',
    '빠', '뺘', '뻐', '뼈', '뽀', '뾰', '뿌', '쀼', '쁘', '삐',
    '싸', '쌰', '써', '쎠', '쏘', '쑈', '쑤', '쓔', '쓰', '씨',
    '짜', '쨔', '쩌', '쪄', '쪼', '쬬', '쭈', '쮸', '쯔', '찌',
]

SYLLABLES_TYPE_4 = [
    '깨', '꺠', '께', '꼐', '꽈', '꽤', '꾀', '꿔', '꿰', '뀌', '끠',
    '때', '떄', '떼', '뗴', '똬', '뙈', '뙤', '뚸', '뛔', '뛰', '띄',
    '빼', '뺴', '뻬', '뼤', '뽜', '뽸', '뾔', '뿨', '쀄', '쀠', '쁴',
    '쌔', '썌', '쎄', '쎼', '쏴', '쐐', '쐬', '쒀', '쒜', '쒸', '씌',
    '째', '쨰', '쩨', '쪠', '쫘', '쫴', '쬐', '쭤', '쮀', '쮜', '쯰',
]

SYLLABLE_TRANSCRIPTIONS = {
    '가': 'ga', '갸': 'gya', '거': 'geo', '겨': 'gyeo', '고': 'go', '교': 'gyo', '구': 'gu', '규': 'gyu', '그': 'geu',
    '기': 'gi', '개': 'gae', '걔': 'gyae', '게': 'ge', '계': 'gye', '과': 'gwa', '괘': 'gwae', '괴': 'goe', '궈': 'gwo',
    '궤': 'gwe', '귀': 'gwi', '긔': 'gui', '나': 'na', '냐': 'nya', '너': 'neo', '녀': 'nyeo', '노': 'no', '뇨': 'nyo',
    '누': 'nu', '뉴': 'nyu', '느': 'neu', '니': 'ni', '내': 'nae', '냬': 'nyae', '네': 'ne', '녜': 'nye', '놔': 'nwa',
    '놰': 'nwae', '뇌': 'noe', '눠': 'nwo', '눼': 'nwe', '뉘': 'nwi', '늬': 'nui', '다': 'da', '댜': 'dya', '더': 'deo',
    '뎌': 'dyeo', '도': 'do', '됴': 'dyo', '두': 'du', '듀': 'dyu', '드': 'deu', '디': 'di', '대': 'dae', '댸': 'dyae',
    '데': 'de', '뎨': 'dye', '돠': 'dwa', '돼': 'dwae', '되': 'doe', '둬': 'dwo', '뒈': 'dwe', '뒤': 'dwi', '듸': 'dui',
    '라': 'ra', '랴': 'rya', '러': 'reo', '려': 'ryeo', '로': 'ro', '료': 'ryo', '루': 'ru', '류': 'ryu', '르': 'reu',
    '리': 'ri', '래': 'rae', '럐': 'ryae', '레': 're', '례': 'rye', '롸': 'rwa', '뢔': 'rwae', '뢰': 'roe', '뤄': 'rwo',
    '뤠': 'rwe', '뤼': 'rwi', '릐': 'rui', '마': 'ma', '먀': 'mya', '머': 'meo', '며': 'myeo', '모': 'mo', '묘': 'myo',
    '무': 'mu', '뮤': 'myu', '므': 'meu', '미': 'mi', '매': 'mae', '먜': 'myae', '메': 'me', '몌': 'mye', '뫄': 'mwa',
    '뫠': 'mwae', '뫼': 'moe', '뭐': 'mwo', '뭬': 'mwe', '뮈': 'mwi', '믜': 'mui', '바': 'ba', '뱌': 'bya', '버': 'beo',
    '벼': 'byeo', '보': 'bo', '뵤': 'byo', '부': 'bu', '뷰': 'byu', '브': 'beu', '비': 'bi', '배': 'bae', '뱨': 'byae',
    '베': 'be', '볘': 'bye', '봐': 'bwa', '봬': 'bwae', '뵈': 'boe', '붜': 'bwo', '붸': 'bwe', '뷔': 'bwi', '븨': 'bui',
    '사': 'sa', '샤': 'sya', '서': 'seo', '셔': 'syeo', '소': 'so', '쇼': 'syo', '수': 'su', '슈': 'syu', '스': 'seu',
    '시': 'si', '새': 'sae', '섀': 'syae', '세': 'se', '셰': 'sye', '솨': 'swa', '쇄': 'swae', '쇠': 'soe', '숴': 'swo',
    '쉐': 'swe', '쉬': 'swi', '싀': 'sui', '아': 'a', '야': 'ya', '어': 'eo', '여': 'yeo', '오': 'o', '요': 'yo', '우': 'u',
    '유': 'yu', '으': 'eu', '이': 'i', '애': 'ae', '얘': 'yae', '에': 'e', '예': 'ye', '와': 'wa', '왜': 'wae', '외': 'oe',
    '워': 'wo', '웨': 'we', '위': 'wi', '의': 'ui', '자': 'ja', '쟈': 'jya', '저': 'jeo', '져': 'jyeo', '조': 'jo',
    '죠': 'jyo', '주': 'ju', '쥬': 'jyu', '즈': 'jeu', '지': 'ji', '재': 'jae', '쟤': 'jyae', '제': 'je', '졔': 'jye',
    '좌': 'jwa', '좨': 'jwae', '죄': 'joe', '줘': 'jwo', '줴': 'jwe', '쥐': 'jwi', '즤': 'jui', '차': 'cha', '챠': 'chya',
    '처': 'cheo', '쳐': 'chyeo', '초': 'cho', '쵸': 'chyo', '추': 'chu', '츄': 'chyu', '츠': 'cheu', '치': 'chi',
    '채': 'chae', '챼': 'chyae', '체': 'che', '쳬': 'chye', '촤': 'chwa', '쵀': 'chwae', '최': 'choe', '춰': 'chwo',
    '췌': 'chwe', '취': 'chwi', '츼': 'chui', '카': 'ka', '캬': 'kya', '커': 'keo', '켜': 'kyeo', '코': 'ko', '쿄': 'kyo',
    '쿠': 'ku', '큐': 'kyu', '크': 'keu', '키': 'ki', '캐': 'kae', '컈': 'kyae', '케': 'ke', '켸': 'kye', '콰': 'kwa',
    '쾌': 'kwae', '쾨': 'koe', '쿼': 'kwo', '퀘': 'kwe', '퀴': 'kwi', '킈': 'kui', '타': 'ta', '탸': 'tya', '터': 'teo',
    '텨': 'tyeo', '토': 'to', '툐': 'tyo', '투': 'tu', '튜': 'tyu', '트': 'teu', '티': 'ti', '태': 'tae', '턔': 'tyae',
    '테': 'te', '톄': 'tye', '톼': 'twa', '퇘': 'twae', '퇴': 'toe', '퉈': 'two', '퉤': 'twe', '튀': 'twi', '틔': 'tui',
    '파': 'pa', '퍄': 'pya', '퍼': 'peo', '펴': 'pyeo', '포': 'po', '표': 'pyo', '푸': 'pu', '퓨': 'pyu', '프': 'peu',
    '피': 'pi', '패': 'pae', '퍠': 'pyae', '페': 'pe', '폐': 'pye', '퐈': 'pwa', '퐤': 'pwae', '푀': 'poe', '풔': 'pwo',
    '풰': 'pwe', '퓌': 'pwi', '픠': 'pui', '하': 'ha', '햐': 'hya', '허': 'heo', '혀': 'hyeo', '호': 'ho', '효': 'hyo',
    '후': 'hu', '휴': 'hyu', '흐': 'heu', '히': 'hi', '해': 'hae', '햬': 'hyae', '헤': 'he', '혜': 'hye', '화': 'hwa',
    '홰': 'hwae', '회': 'hoe', '훠': 'hwo', '훼': 'hwe', '휘': 'hwi', '희': 'hui', '까': 'kka', '꺄': 'kkya', '꺼': 'kkeo',
    '껴': 'kkyeo', '꼬': 'kko', '꾜': 'kkyo', '꾸': 'kku', '뀨': 'kkyu', '끄': 'kkeu', '끼': 'kki', '깨': 'kkae',
    '꺠': 'kkyae', '께': 'kke', '꼐': 'kkye', '꽈': 'kkwa', '꽤': 'kkwae', '꾀': 'kkoe', '꿔': 'kkwo', '꿰': 'kkwe',
    '뀌': 'kkwi', '끠': 'kkui', '따': 'tta', '땨': 'ttya', '떠': 'tteo', '뗘': 'ttyeo', '또': 'tto', '뚀': 'ttyo',
    '뚜': 'ttu', '뜌': 'ttyu', '뜨': 'tteu', '띠': 'tti', '때': 'ttae', '떄': 'ttyae', '떼': 'tte', '뗴': 'ttye',
    '똬': 'ttwa', '뙈': 'ttwae', '뙤': 'ttoe', '뚸': 'ttwo', '뛔': 'ttwe', '뛰': 'ttwi', '띄': 'ttui', '빠': 'ppa',
    '뺘': 'ppya', '뻐': 'ppeo', '뼈': 'ppyeo', '뽀': 'ppo', '뾰': 'ppyo', '뿌': 'ppu', '쀼': 'ppyu', '쁘': 'ppeu',
    '삐': 'ppi', '빼': 'ppae', '뺴': 'ppyae', '뻬': 'ppe', '뼤': 'ppye', '뽜': 'ppwa', '뽸': 'ppwae', '뾔': 'ppoe',
    '뿨': 'ppwo', '쀄': 'ppwe', '쀠': 'ppwi', '쁴': 'ppui', '싸': 'ssa', '쌰': 'ssya', '써': 'sseo', '쎠': 'ssyeo',
    '쏘': 'sso', '쑈': 'ssyo', '쑤': 'ssu', '쓔': 'ssyu', '쓰': 'sseu', '씨': 'ssi', '쌔': 'ssae', '썌': 'ssyae',
    '쎄': 'sse', '쎼': 'ssye', '쏴': 'sswa', '쐐': 'sswae', '쐬': 'ssoe', '쒀': 'sswo', '쒜': 'sswe', '쒸': 'sswi',
    '씌': 'ssui', '짜': 'jja', '쨔': 'jjya', '쩌': 'jjeo', '쪄': 'jjyeo', '쪼': 'jjo', '쬬': 'jjyo', '쭈': 'jju',
    '쮸': 'jjyu', '쯔': 'jjeu', '찌': 'jji', '째': 'jjae', '쨰': 'jjyae', '쩨': 'jje', '쪠': 'jjye', '쫘': 'jjwa',
    '쫴': 'jjwae', '쬐': 'jjoe', '쭤': 'jjwo', '쮀': 'jjwe', '쮜': 'jjwi', '쯰': 'jjui'
}
